const variant = document.querySelector('#var');
const startButton = document.querySelector('.calc');
const qt1 = [
    [0.0000035,	    0.0000078,	0.0000012,	0,	        0,	        0.00000055,	0,	        0.00000015,	0,	        0           ],
    [0,	            0.0000025,	0,	        0.00000035,	0,	        0.00000065,	0.00000032,	0,	        0.0000021,	0.0000027   ],
    [0.00000332,	0.0000021,	0.0000023,	0.00000096,	0.00000004,	0,	        0,	        0.00000051,	0.0000082,	0,          ],
    [0,	            0.0000042,	0.0000034,	0.00000033,	0.00000015,	0,	        0.00000015,	0,	        0.0000029,	0.0000039   ],
    [0.0000015,	    0,	        0.0000098,	0,	        0.00000009,	0.00000015,	0,	        0.00000024,	0,	        0           ],
    [0,	            0.0000083,	0,	        0.00000018,	0,	        0.00000025,	0.00000067,	0.00000042,	0.0000063,	0.0000076   ],
    [0.00000745,	0.0000049,	0.0000091,	0,	        0.00000092,	0,	        0,	        0.00000089,	0,	        0           ],
    [0,	            0.0000036,	0.0000025,	0,	        0.00000086,	0.00000032,	0.00000081,	0,	        0.000005,	0.0000026   ],
    [0.0000029,	    0,	        0.0000065,	0.00000059,	0.00000041,	0,	        0,	        0.00000072,	0.0000083,	0           ],
    [0,	            0,	        0,	        0.00000034,	0,	        0.00000039,	0.00000004,	0.00000027,	0,	        0.0000042   ],
];
const qt2 = [
    [0.099,	    0.057,  	0.039,  	0.122,  	0.016,  	0.117,  	0.074,  	0.024,  	0.046,  	0.008],
    [0.062,	    0.041,  	0.049,  	0.04,	    0.051,	    0.01,   	0.068,  	0.032,  	0.06,	    0.027],
    [0.025,	    0.058,  	0.05,	    0.141,	    0.144,	    0.072,  	0.027,  	0.04,	    0.013,	    0.014],
    [0.049,	    0.025,  	0.061,  	0.042,  	0.079,  	0.083,  	0.005,  	0.047,  	0.148,  	0.017],
    [0.067,	    0.151,  	0.018,  	0.073,  	0.002,  	0.023,  	0.04,	    0.027,	    0.006,	    0.028],
    [0.113,	    0.13,	    0.009,	    0.021,	    0.036,	    0.083,  	0.048,  	0.047,  	0.066,  	0.007],
    [0.072,	    0.018,  	0.128,  	0.073,  	0.08,	    0.016,  	0.081,  	0.019,  	0.086,  	0.012],
    [0.056,	    0.054,  	0.016,  	0.05,	    0.005,	    0.193,  	0.005,  	0.024,  	0.048,  	0.022],
    [0.009,	    0.023,  	0.098,  	0.121,  	0.103,  	0.003,  	0.047,  	0.067,  	0.025,  	0.022],
    [0.013,	    0.074,  	0.121,  	0.01,	    0.122,	    0.257,  	0.082,  	0.086,  	0.025,  	0.013],
];

const tao1 = [
    [1, 1,  1,  1,  1,  1,  3,  3,  3,  3],
    [2, 2,  3,  3,  4,  4,  1,  2,  2,  4],
    [3, 4,  2,  4,  2,  3,  4,  1,  4,  1],
    [4, 3,  4,  2,  3,  2,  2,  4,  1,  2],

];

const tao2 = [
    [2, 2,	2,	2,	2,	2,	4,	4,	4,	4],
    [1, 1,	3,	3,	4,	4,	1,	2,	2,	3],
    [3, 4,	1,	4,	1,	3,	3,	1,	3,	1],
    [4, 3,	4,	1,	3,	1,	2,	3,	1,	2],
];

let qtsokn;
let date1 = document.querySelectorAll('.date1');
let date2 = document.querySelectorAll('.date2');
let destvie1 = document.querySelectorAll('.destvie1');
let destvie2 = document.querySelectorAll('.destvie2');
let destvie3 = document.querySelector('.destvie3');
let destvie4 = document.querySelector('.destvie4');
let otvet2 = document.querySelectorAll('.otvet2');


startButton.onclick = () => {
    //ЗАДАНИЕ 1
    destvie3.innerHTML = 1;
    for (let i = 0; i <= 9; i++) {
        date1[i].innerHTML = qt1[i][variant.value[1]];
        date2[i].innerHTML = qt2[i][variant.value[0]];
        if (qt1[i][variant.value[1]] == 0) {
            destvie1[i].innerHTML = 0;    
        } else {destvie1[i].innerHTML = (qt1[i][variant.value[1]] * qt2[i][variant.value[0]]).toFixed(12);}
        destvie2[i].innerHTML = (1 - qt1[i][variant.value[1]] * qt2[i][variant.value[0]]);
        destvie3.innerHTML *= (1 - qt1[i][variant.value[1]] * qt2[i][variant.value[0]]);
    }
    destvie4.innerHTML = 1 - destvie3.innerHTML;

    //ЗАДАНИЕ 2
    if (variant.value[0] % 2 == 1) {
        for (let i = 0; i <= 3; i++) {
            otvet2[i].innerHTML = tao1[i][variant.value[1]];
        }
    } else {
        for (let i = 0; i <= 3; i++) {
            otvet2[i].innerHTML = tao2[i][variant.value[1]];
        }
    }
}